Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/radio/SI4468/si4468_driver.cpp
	if ( !si446x_spi_lock() ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_sleep() FAIL. SPI locked.\r\n");
		return DS_Busy;
	}

	if (!isInit) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_sleep() FAIL. No Init.\r\n");
		si446x_spi_unlock();
		return DS_Busy;
	}

	si446x_change_state(SI_STATE_SLEEP);

	si446x_radio_unlock();
	si446x_spi_unlock();

	return DS_Success;
}


DeviceStatus si446x_hal_tx_power(UINT8 radioID, int pwr) {
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power()\r\n");

	if (pwr < 0) return DS_Fail; // Not worth of a printf

	if ( !si446x_spi_lock() ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power() FAIL. SPI locked.\r\n");
		return DS_Fail;
	}

	if (!isInit) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power() FAIL. No Init.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	if ( !si446x_radio_lock(radio_lock_tx_power) ) {
		si446x_debug_print(DEBUG02, "SI446X: si446x_hal_tx_power() FAIL. Radio Busy.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	si446x_set_property( 0x22 , 1, 0x01, (uint8_t) pwr );
	tx_power = pwr;

	si446x_radio_unlock();
	si446x_spi_unlock();

	return DS_Success;
}

DeviceStatus si446x_hal_set_channel(UINT8 radioID, int channel) {
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_set_channel()\r\n");
	if (channel < 0 ) return DS_Fail;

	if ( !si446x_spi_lock() ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_set_channel() FAIL. SPI locked.\r\n");
		return DS_Fail;
	}

	if (!isInit) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_set_channel() FAIL. No Init.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	if ( !si446x_radio_lock(radio_lock_set_channel) ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_set_channel() FAIL. Radio Busy.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	si446x_channel = channel;

	// Technically may not need the locks.
	// But could confuse the user otherwise.
	// And still at least protects the vars.
	si446x_radio_unlock();
	si446x_spi_unlock();

	return DS_Success;
}


// Doesn't belong in radio driver... --NPS
//Properties of radio
static INT8 radioType;
void si446x_hal_set_RadioType(INT8 radio)
{
	radioType = radio;
}

// Doesn't belong in radio driver...
INT8 si446x_hal_get_RadioType()
{
	return radioType;
}

DeviceStatus si446x_hal_cca(UINT8 radioID) {
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_cca()\r\n");

	DeviceStatus ret;

	if ( !si446x_spi_lock() ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_cca() FAIL. SPI locked.\r\n");
		return DS_Fail;
	}

	if (!isInit) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_cca() FAIL. No Init.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	if ( !si446x_radio_lock(radio_lock_cca) ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_cca() FAIL. Radio Busy.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	si446x_start_rx_fast_channel(si446x_channel);
	for(int i=0; i<160000; i++); // TODO: something less silly. Want to wait 10ms I think. --NPS
	si446x_get_modem_status( 0xFF );
	if (si446x_get_current_rssi() >= si446x_rssi_cca_thresh)
		ret = DS_Busy;
	else
		ret = DS_Success;

	si446x_radio_unlock();
	si446x_spi_unlock();

	return ret;
}

// TODO: ms is ignored
DeviceStatus si446x_hal_cca_ms(UINT8 radioID, UINT32 ms) {
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_cca()\r\n");

	DeviceStatus ret;

	if ( !si446x_spi_lock() ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_cca_ms() FAIL. SPI locked.\r\n");
		return DS_Fail;
	}

	if (!isInit) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_cca_ms() FAIL. No Init.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	if ( !si446x_radio_lock(radio_lock_cca_ms) ) {
		si446x_debug_print(DEBUG01, "SI446X: si446x_hal_cca_ms() FAIL. Radio Busy.\r\n");
		si446x_spi_unlock();
		return DS_Fail;
	}

	si446x_start_rx_fast_channel(si446x_channel);
	for(int i=0; i<160000; i++); // TODO: something less silly. Want to wait 10ms I think. --NPS
	si446x_get_modem_status( 0xFF );
	if (si446x_get_current_rssi() >= si446x_rssi_cca_thresh)
		ret = DS_Busy;
	else
		ret = DS_Success;

	si446x_radio_unlock();
	si446x_spi_unlock();

	return ret;
}

UINT32 si446x_hal_get_chan(UINT8 radioID) {
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_get_chan()\r\n");
	return si446x_channel;
}


UINT32 si446x_hal_get_power(UINT8 radioID) {
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_get_power()\r\n");
	return tx_power;
}

// Also possible to do this with FRR.
// Automatically saved each packet, don't need to bother radio or lock.
UINT32 si446x_hal_get_rssi(UINT8 radioID) {
	UINT32 ret = si446x_get_latched_rssi();
	si446x_debug_print(DEBUG02, "SI446X: si446x_hal_get_rssi() : %d\r\n", ret);
	return ret;
}

// INTERRUPT CONTEXT, LOCKED
static void si446x_pkt_tx_int() {
	si446x_debug_print(DEBUG02, "SI446X: si446x_pkt_tx_int()\r\n");
	tx_callback_continuation.Enqueue();
}

// INTERRUPT CONTEXT. LOCKED, radio_busy until we pull from continuation
static void si446x_pkt_rx_int() {
	radio_lock_id_t owner;
	si446x_debug_print(DEBUG01, "SI446X: si446x_pkt_rx_int()\r\n");
	if (owner = si446x_radio_lock_get_owner()) {
		si446x_debug_print(ERR100,
#		ifdef SI446X_RADIO_LOCK_RESOLVE
							"SI446X: si446x_pkt_rx_int() Radio was locked by %s\r\n", radio_lock_owners[owner]);
#		else
							"SI446X: si446x_pkt_rx_int() Radio was locked by %d\r\n", owner);
#		endif
	}
	else {
		si446x_radio_lock(radio_lock_rx);
		rx_callback_continuation.Enqueue();
	}
}

// INTERRUPT CONTEXT, LOCKED
static void si446x_pkt_bad_crc_int() {
	if ( si446x_spi_lock() ) {
		si446x_fifo_info(0x3); // clear the FIFOs if we can
		si446x_debug_print(DEBUG02, "SI446X: si446x_pkt_bad_crc_int() FIFOs cleared\r\n");
		si446x_spi_unlock();
	}
	si446x_debug_print(DEBUG02, "SI446X: si446x_pkt_bad_crc_int()\r\n");
}

// INTERRUPT CONTEXT
static void si446x_spi2_handle_interrupt(GPIO_PIN Pin, BOOL PinState, void* Param)
{
	unsigned modem_pend, ph_pend;
	UINT64 int_ts;

	GLOBAL_LOCK(irq); // Locked due to time critical.
	int_ts = HAL_Time_CurrentTicks(); // Log RX time.
	irq.Release(); // Unlock after timestamp.

	if (Pin != SI446X_pin_setup.nirq_mf_pin && Pin != 0xFFFF) { return; }

	si446x_debug_print(DEBUG01, "SI446X: INT\r\n");

	if ( !si446x_spi_lock() ) {
		// Damn, we got an interrupt in the middle of another transaction. Have to defer it.
		// Hope this doesn't happen much because will screw up timestamp.
		// TODO: Spend some effort to mitigate this if/when it happens.
		si446x_debug_print(ERR99, "SI446X: si446x_spi2_handle_interrupt() SPI busy. Interrupt processing deferred.\r\n");
		int_defer_continuation.Enqueue();
		return;
	}

	si446x_get_int_status(0x0, 0x0, 0x0); // Saves status and clears all interrupts
	ph_pend			= si446x_get_ph_pend();
	modem_pend 		= si446x_get_modem_pend();

	si446x_spi_unlock();

	// Only save timestamp if it was an RX event.
	if (modem_pend & MODEM_MASK_SYNC_DETECT)		{ rx_timestamp = int_ts; }

	if (ph_pend & PH_STATUS_MASK_PACKET_RX) 	{ si446x_pkt_rx_int(); }
	if (ph_pend & PH_STATUS_MASK_PACKET_SENT) 	{ si446x_pkt_tx_int(); }
	if (ph_pend & PH_STATUS_MASK_CRC_ERROR) 	{ si446x_pkt_bad_crc_int(); }
}
